Tekla Open API Reference for Tekla Structures 2025
CatalogHandler.ExportProfileItems Method
 Exports the profile items in the profile database to given path and file name. Currently library profiles, sketch profiles and clb profiles are supported. Library profiles are exported to *.lis format. Sketch profiles are exported to *.uel format. Clb profiles are exported to *.clb format. If profiles are not available, export fails. If path is empty, export fails. If file name is empty, export fails.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ExportProfileItems(
	IList<string> profileNames,
	string path,
	string fileName
)
Public Function ExportProfileItems (
	profileNames As IList(Of String),
	path As String,
	fileName As String
) As Boolean
Parameters
profileNames
Type: System.Collections.Generic.IList<String>
[Missing <param name="profileNames"/> documentation for "M:Tekla.Structures.Catalogs.CatalogHandler.ExportProfileItems(System.Collections.Generic.IList{System.String},System.String,System.String)"]
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Tekla.Structures.Catalogs.CatalogHandler.ExportProfileItems(System.Collections.Generic.IList{System.String},System.String,System.String)"]
fileName
Type: System.String
[Missing <param name="fileName"/> documentation for "M:Tekla.Structures.Catalogs.CatalogHandler.ExportProfileItems(System.Collections.Generic.IList{System.String},System.String,System.String)"]
Return Value
Type: Boolean
True on success.
Examples
using System;
using Tekla.Structures.Catalogs;
public class Example
{
    public void Example1()
    {
        var profiles = new[] { "HEA100", "HEB100", "HEAA300" };
        if (new CatalogHandler().ExportProfileItems(profiles, System.IO.Path.GetTempPath(), "I Profiles"))
        {
            Console.WriteLine("Profiles exported successfully");
        }
    }
}
See Also
Reference
CatalogHandler Class
Tekla.Structures.Catalogs Namespace